In [1]:
import pandas as pd

In [2]:
date_list = {"yyyy-mm-dd":["2005-09-28", "2007-10-05", "2012-12-10"]}
df = pd.DataFrame(date_list)
df

   yyyy-mm-dd
0  2005-09-28
1  2007-10-05
2  2012-12-10

In [4]:
"2005-09-28".split("-")[0]

'2005'

In [5]:
"2005-09-28".split("-")[1]

'09'

In [6]:
"2005-09-28".split("-")[2]

'28'

In [7]:
def extract_year(column):
    return column.split("-")[0]

In [8]:
df

   yyyy-mm-dd
0  2005-09-28
1  2007-10-05
2  2012-12-10

In [9]:
df['year'] = df['yyyy-mm-dd'].apply(extract_year)
df

   yyyy-mm-dd  year
0  2005-09-28  2005
1  2007-10-05  2007
2  2012-12-10  2012

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   yyyy-mm-dd  3 non-null      object
 1   year        3 non-null      object
dtypes: object(2)
memory usage: 176.0+ bytes

In [10]:
def get_age(year, current_year):
    return current_year-int(year)

In [13]:
df["age"] = df['year'].apply(get_age,current_year=2021)
df

   yyyy-mm-dd  year  age
0  2005-09-28  2005   16
1  2007-10-05  2007   14
2  2012-12-10  2012    9

In [2]:
df = pd.DataFrame({"영어": [60,70], "수학":[100,50]}, index=["Dave", "David"])
df

       영어   수학
Dave   60  100
David  70   50

In [3]:
def func(df_data):
    print(type(df_data))
    print(df_data.index)
    print(df_data.values)
    return df_data

In [4]:
# 열 기준으로 함수 적용

df_func = df.apply(func, axis=0)
df_func

<class 'pandas.core.series.Series'>
Index(['Dave', 'David'], dtype='object')
[60 70]
<class 'pandas.core.series.Series'>
Index(['Dave', 'David'], dtype='object')
[100  50]

       영어   수학
Dave   60  100
David  70   50

In [5]:
# 행 기준으로 함수 적용

df_func = df.apply(func, axis=1)
df_func

<class 'pandas.core.series.Series'>
Index(['영어', '수학'], dtype='object')
[ 60 100]
<class 'pandas.core.series.Series'>
Index(['영어', '수학'], dtype='object')
[70 50]

       영어   수학
Dave   60  100
David  70   50

In [6]:
def func2(df_data): #영어점수를 모두 80으로 변경 변경
    df_data["영어"] = 80
    return df_data

In [7]:
df_func2 = df.apply(func2, axis=1)
df_func2

       영어   수학
Dave   80  100
David  80   50